"""
用来存在一些重要初始变量,方便其他程序调用
尽量避免180度附近的欧拉角，不然容易出现跳变问题
"""

import numpy as np

# （这两个用来确定转换矩阵）
# 手眼标定结果rviz_end to cam，RPY角
euler_g = [0.00767593,-0.00354446,-0.0693474,88.5618,-30.5082,-89.6558]
# end_to_rviz
end_to_rviz_g = np.array([[1.48741681e-17, 2.77555756e-16, -1.00000000e+00, 0],
                          [-2.47807420e-16, -1.00000000e+00, -2.47807420e-16, 0],
                          [-1.00000000e+00, 2.77555756e-16, -1.11022302e-16, 0],
                          [0, 0, 0, 1]])  # 处于位置1

# 机械手在桌子上
# initP_g = [180.695189, 399.452541, 260.479814, 89.257917, -60.547234, -88.43694]  # 第一次的位置(欧拉角度)
# initA_g = [44.247835, -15.610962, 43.182903, -207.333984, 46, 60.205078]  # 第一次的位置(角度)---水平夹爪

# 机械手在小车上
# initP_g = [-108, 240, 466, 90, -60, -179.9]  # 第一次的位置(欧拉角度)
# initA_g = [90, -107, 126, -199, -90, 60]  # 第一次的位置(角度)---水平夹爪

# 机械手在小车上
# initP_g = [-59,-243,441.68,90,-60,0]  # 第一次的位置(欧拉角度)
# initA_g = [-146,-110,134,-203.5,-33.5,60]  # 第一次的位置(角度)---水平夹爪

# 机械手在小车上(front)
initP_g = [216.93,175.67,414.85,90,-60,90]  # 第一次的位置(欧拉角度)
initA_g = [22.45,-92,126,-214,-112,60]  # 第一次的位置(角度)---水平夹爪